Documents/ЗавершениеРаботыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗавершениеРаботыОрганизации</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаДанныхДолжника</xr:Item>
				<xr:Item>Document.ЗагрузкаДанных</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоКатегориям</xr:Item>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
				<xr:Item>AccumulationRegister.ИсковыеТребования</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиВПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиВПомощь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗавершениеРаботыОрганизации/Ext/ObjectModule.bsl
Процедура ОбработкаУдаленияПроведения(Отказ)
	//ПроведениеСервер.ОчиститьДвиженияДокумента(ЭтотОбъект,, Отказ); 
	ЭтотОбъект.Движения.ОбъектыВРаботе.Записывать = Истина;
	ЭтотОбъект.Движения.СобытияПоОбъектам.Записывать = Истина;
	ЭтотОбъект.Движения.СостоянияПоКатегориям.Записывать = Истина;
	ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Записывать = Истина;
	ЭтотОбъект.Движения.Записать();
	Отказ = ПроведениеСервер.ПроверитьВозможностьПроведенияНов(ЭтотОбъект);
КонецПроцедуры

#Область ВыводИзРаботы

Процедура УбратьИзРаботыСотрудников(ТаблицаДвиженийОбъекты, ТаблицаДвиженийОтветственные)

	УбратьИзРаботыОбъекты(ТаблицаДвиженийОбъекты);
	ОчиститьОтветственных(ТаблицаДвиженийОтветственные);

КонецПроцедуры

Процедура УбратьИзРаботыОбъекты(ТаблицаДвиженийОбъекты)

	Если ТаблицаДвиженийОбъекты.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ОбъектыВРаботе.Загрузить(ТаблицаДвиженийОбъекты);
		ЭтотОбъект.Движения.ОбъектыВРаботе.Записывать = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОчиститьОтветственных(ТаблицаДвиженийОтветственные)

	Если ТаблицаДвиженийОтветственные.Количество() <= 0 Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Для каждого Ответственный Из ТаблицаДвиженийОтветственные Цикл
	
		РегистрОтветственности = РегистрыСведений.ОтветственныеСотрудники;
		Если СтрСравнить(Ответственный.ТипРегистра, "Помощь") = 0 Тогда
		
			РегистрОтветственности = РегистрыСведений.СотрудникиВПомощь;
		
		КонецЕсли;
		
		РегистрОтветственности.СнятьВсехОтветственных(Ответственный.Объект);
	
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицыДвижений = Новый Структура;
	ТаблицыДвижений.Вставить("Объекты", Неопределено);
	ТаблицыДвижений.Вставить("Ответственные", Неопределено);
	ТаблицыДвижений.Вставить("События", Неопределено);
	ТаблицыДвижений.Вставить("Категории", Неопределено);
	ТаблицыДвижений.Вставить("Задолженность", Неопределено);
	ТаблицыДвижений.Вставить("ЗадолженностьВнесудебна", Неопределено);
	ТаблицыДвижений.Вставить("ЗадолженностьСудебная", Неопределено);
	ТаблицыДвижений.Вставить("ЗадолженностьИск", Неопределено);
	//ТаблицаДвиженийОбъекты = Неопределено;
	//ТаблицаДвиженийСобытия = Неопределено;
	//ТаблицаДвиженийКатегории = Неопределено;
	//ТаблицаДвиженийЗадолженность = Неопределено; 
	//ТаблицаДвиженийЗадолженностьВнесудебная = Неопределено;
	//ТаблицаДвиженийЗадолженностьСудебная = Неопределено;
	//ТаблицаДвиженийЗадолженностьИск = Неопределено;
	
	//Документы.ЗавершениеРаботыОрганизации.ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, 
	//		ТаблицаДвиженийСобытия, ТаблицаДвиженийКатегории, ТаблицаДвиженийЗадолженность,ТаблицаДвиженийЗадолженностьВнесудебная,ТаблицаДвиженийЗадолженностьСудебная,ТаблицаДвиженийЗадолженностьИск);
	
	Документы.ЗавершениеРаботыОрганизации.ИнициализироватьДанныеДокумента(
		ЭтотОбъект,
		ТаблицыДвижений
	);
	
	ТаблицаДвиженийОбъекты = ТаблицыДвижений["Объекты"];
	ПроведениеСервер.ВыполнитьКонтрольДвиженийОбъектов(
		ТаблицаДвиженийОбъекты, 
		Перечисления.ВидКонтроля.Отсутствие,
		Отказ
	);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	УбратьИзРаботыСотрудников(
		ТаблицаДвиженийОбъекты,
		ТаблицыДвижений["Ответственные"]
	);
	
	ТаблицаДвиженийСобытия = ТаблицыДвижений["События"];
	Если Не Отказ И ТаблицаДвиженийСобытия.Количество() > 0 Тогда
		ЭтотОбъект.Движения.СобытияПоОбъектам.Загрузить(ТаблицаДвиженийСобытия);
		ЭтотОбъект.Движения.СобытияПоОбъектам.Записывать = Истина;
	КонецЕсли;
	
	ТаблицаДвиженийКатегории = ТаблицыДвижений["Категории"];
	Если Не Отказ И ТаблицаДвиженийКатегории <> Неопределено И ТаблицаДвиженийКатегории.Количество() > 0 Тогда
		ЭтотОбъект.Движения.СостоянияПоКатегориям.Загрузить(ТаблицаДвиженийКатегории);
		ЭтотОбъект.Движения.СостоянияПоКатегориям.Записывать = Истина;
	КонецЕсли;
	
	ТаблицаДвиженийЗадолженность = ТаблицыДвижений["Задолженность"];
	Если Не Отказ И ТаблицаДвиженийЗадолженность <> Неопределено И ТаблицаДвиженийЗадолженность.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Загрузить(ТаблицаДвиженийЗадолженность);
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектам.Записывать = Истина;
	КонецЕсли;
	
	ТаблицаДвиженийЗадолженностьВнесудебная = ТаблицыДвижений["ЗадолженностьВнесудебна"];
	Если Не Отказ И ТаблицаДвиженийЗадолженностьВнесудебная <> Неопределено И ТаблицаДвиженийЗадолженностьВнесудебная.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Загрузить(ТаблицаДвиженийЗадолженностьВнесудебная);
		ЭтотОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Записывать = Истина;
	КонецЕсли;
	
	ТаблицаДвиженийЗадолженностьСудебная = ТаблицыДвижений["ЗадолженностьСудебная"];
	Если Не Отказ И ТаблицаДвиженийЗадолженностьСудебная <> Неопределено И ТаблицаДвиженийЗадолженностьСудебная.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ЗадолженностьПоСудебнымРешениям.Загрузить(ТаблицаДвиженийЗадолженностьСудебная);
		ЭтотОбъект.Движения.ЗадолженностьПоСудебнымРешениям.Записывать = Истина;
	КонецЕсли;
	
	ТаблицаДвиженийЗадолженностьИск = ТаблицыДвижений["ЗадолженностьИск"];
	Если Не Отказ И ТаблицаДвиженийЗадолженностьИск <> Неопределено И ТаблицаДвиженийЗадолженностьИск.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ИсковыеТребования.Загрузить(ТаблицаДвиженийЗадолженностьИск);
		ЭтотОбъект.Движения.ИсковыеТребования.Записывать = Истина;
	КонецЕсли;
	
	Если Не Отказ И ТаблицаДвиженийОбъекты <> Неопределено И ТаблицаДвиженийОбъекты.Количество() > 0 Тогда
		 ОтменитьПроведениеМикрозаймов(ТаблицаДвиженийОбъекты);
	КонецЕсли;

	
	ЭтотОбъект.Движения.Записать();	
	
	Блокировка = Новый БлокировкаДанных;
	Эл = Блокировка.Добавить("Константа.СинхронизацияДанныхЗапущена");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	Если Константы.СинхронизацияДанныхЗапущена.Получить() = Ложь Тогда
		Константы.СинхронизацияДанныхЗапущена.Установить(Истина);	
	КонецЕсли;
	//////Попытка 
	//////	ФоновыеЗадания.Выполнить("ОбъектыСервер.СинхронизироватьРегистры_ОбъектыВРаботе",,"02");
	//////Исключение
	//////	Сообщить(ОписаниеОшибки());
	//////КонецПопытки;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);	
	//ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПринятиеВРаботуОрганизации") Или 
	//		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктПередачи") Или 
	//		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗагрузкаЗадолженности") Тогда 
	    
		//Автор = ДанныеЗаполнения.Автор;
		//Комментарий = ДанныеЗаполнения.Комментарий;
		//Организация = ДанныеЗаполнения.Организация;
		//ДокументОснование = ДанныеЗаполнения;
		//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗагрузкаДанныхДолжника") Тогда
		//	ТЗ = ДанныеЗаполнения.ТаблицаЗначений.Получить();
		//	Если ТЗ <> Неопределено Тогда
		//		Для Каждого Элемент Из ТЗ Цикл
		//			ЭтотОбъект.Объекты.Добавить().Объект = Элемент.СсылкаДО;
		//		КонецЦикла;
		//	КонецЕсли;
		//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗагрузкаДанных") Тогда
		//	ТЗ = ДанныеЗаполнения.ТаблицаЗначений.Получить();
		//	Если ТЗ <> Неопределено Тогда
		//		Для Каждого Элемент Из ТЗ Цикл
		//			ЭтотОбъект.Объекты.Добавить().Объект = Элемент.Объект;
		//		КонецЦикла;
		//	КонецЕсли;
		//Иначе
		//	Объекты.Загрузить(ДанныеЗаполнения.Объекты.Выгрузить());
		//КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Процедура ОтменитьПроведениеМикрозаймов(ТаблицаДвиженийОбъекты)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорМикрозайма.Ссылка КАК Договор
	                      |ИЗ
	                      |	Документ.ДоговорМикрозайма КАК ДоговорМикрозайма
	                      |ГДЕ
	                      |	ДоговорМикрозайма.Займ В(&Займ)
	                      |	И ДоговорМикрозайма.Проведен = ИСТИНА
	                      |	И ДоговорМикрозайма.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеструктуризацияМикрозайма.Ссылка
	                      |ИЗ
	                      |	Документ.РеструктуризацияМикрозайма КАК РеструктуризацияМикрозайма
	                      |ГДЕ
	                      |	РеструктуризацияМикрозайма.Проведен = ИСТИНА
	                      |	И РеструктуризацияМикрозайма.ПометкаУдаления = ЛОЖЬ
	                      |	И РеструктуризацияМикрозайма.Займ В(&Займ)");
	
	Запрос.УстановитьПараметр("Займ", Объектысервер.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДвиженийОбъекты.ВыгрузитьКолонку("Объект")));
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ДоговорОбъект = Результат.Договор.ПолучитьОбъект();
		ДоговорОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецПроцедуры
